chtSingleChannel/0.org/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1);

boundaryField
{
    fluidInlet
    {/*
        type            fixedValue;
        value           uniform (0 0 13);*/
        type            flowRateInletVelocity;
        massFlowRate    constant 0.02233;
        //rhoInlet        850;          // estimate for initial rho*/
    }

    fluidOutlet
    {
        type            zeroGradient;
        //value           uniform (0 0 0);
    }

    fluidWalls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
