chtSingleChannel/0.org/fluid/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 850;

boundaryField
{
    fluidInlet
    {
        type            fixedValue;
        value           $internalField;
    }

    fluidOutlet
    {
        type            zeroGradient;
        value           $internalField;
    }

    fluidWalls
    {
        type            zeroGradient;
        value           $internalField;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
