chtSingleChannel/0.org/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    solidInside
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        value           uniform 10e3;
        kappa           solidThermo;
        kappaName       none;
    }
    solidOutside
    {
        type            zeroGradient;
    }
    solidSides
    {
        type            zeroGradient;
    }   
    solidWalls
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappa           solidThermo;
        kappaName       none;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
