chtSingleChannel/system/fluid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
dictionaryReplacement
{*/
    boundary
    {
        fluidInlet
        {
            type            patch;
        }
		fluidOutlet
        {
            type            patch;
        }
		
        fluidWalls
        {
            type            mappedWall;
            sampleMode      nearestPatchFaceAMI;
            sampleRegion    solid;
            samplePatch     solidWalls;
        }
        
    }

    U
    {
        internalField   uniform (0 0 2);

        boundaryField
        {
            fluidInlet
            {/*
                type            fixedValue;
                value           uniform (0 0 1);*/
                type            flowRateInletVelocity;
                massFlowRate    constant 0.02233;
                //rhoInlet        850;          // estimate for initial rho
            }

            fluidOutlet
            {
                type            zeroGradient;
                //value           uniform (0 0 0);
            }

            fluidWalls
            {
                type            noSlip;
            }
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            fluidInlet
            {
                type            fixedValue;
                value           uniform 300;
            }

            fluidOutlet
            {
                type            zeroGradient;
            }

            fluidWalls
            {
                type            compressible::turbulentTemperatureCoupledBaffleMixed;
                value           uniform 300;
                Tnbr            T;
                kappaMethod     fluidThermo;
                kappaName       none;
            }

        }
    }

    p_rgh
    {
        internalField   uniform 1e5;

        boundaryField
        {
            fluidInlet
            {
                type            zeroGradient;
                value           $internalField;
            }

            fluidOutlet
            {
                type            fixedValue;
                value           $internalField;
            }

            fluidWalls
            {
                type            zeroGradient;
                value           $internalField;
            }
        }
    }

    p
    {
        internalField   uniform 1e5;

        boundaryField
        {
            fluidInlet
            {
                type            calculated;
                value           $internalField;
            }

            fluidOutlet
            {
                type            calculated;
                value           $internalField;
            }

            fluidWalls
            {
                type            calculated;
                value           $internalField;
            }
        }
    }
    /*
}
*/
// ************************************************************************* //
