chtSingleChannel/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "set.fms";

minCellSize 1e-4;

maxCellSize 1e-4;

boundaryCellSize 1e-4;

/*
boundaryLayers
{
    patchBoundaryLayers
    {
        "walls*"
        {
            nLayers 3;

            thicknessRatio 1.3;

            maxFirstLayerThickness 0.5e-4;
        }
        
    }
    
}*/
// ************************************************************************* //